rusttick/SplitHoverEsc/mm05/MM32SPIN05x_q.svd
				<register>
					<name>CCR5</name>
					<displayName>CCR5</displayName>
					<description>CCR5</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ARE</name>
							<description>Auto-Reload Enable bit</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MEM2MEM</name>
							<description>Memory to memory mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PL</name>
							<description>Channel priority level</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MSIZE</name>
							<description>Memory size</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PSIZE</name>
							<description>Peripheral size</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MINC</name>
							<description>Memory increment mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PINC</name>
							<description>Peripheral increment mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CIRC</name>
							<description>Circular mode</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DIR</name>
							<description>Data transfer direction</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEIE</name>
							<description>Transfer error interrupt enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTIE</name>
							<description>Half transfer interrupt enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCIE</name>
							<description>Transfer complete interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>Channel enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNDTR1</name>
					<displayName>CNDTR1</displayName>
					<description>CNDTR1</description>
					<addressOffset>0x0c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>NDT</name>
							<description>Number of data to transfer</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CNDTR2</name>
					<displayName>CNDTR2</displayName>
					<description>CNDTR2</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>NDT</name>
							<description>Number of data to transfer</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CNDTR3</name>
					<displayName>CNDTR3</displayName>
					<description>CNDTR3</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>NDT</name>
							<description>Number of data to transfer</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CNDTR4</name>
					<displayName>CNDTR4</displayName>
					<description>CNDTR4</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>NDT</name>
							<description>Number of data to transfer</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CNDTR5</name>
					<displayName>CNDTR5</displayName>
					<description>CNDTR5</description>
					<addressOffset>0x5c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>NDT</name>
							<description>Number of data to transfer</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR1</name>
					<displayName>CPAR1</displayName>
					<description>CPAR1</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>PA</name>
							<description>Peripheral address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR2</name>
					<displayName>CPAR2</displayName>
					<description>CPAR2</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>PA</name>
							<description>Peripheral address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR3</name>
					<displayName>CPAR3</displayName>
					<description>CPAR3</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>PA</name>
							<description>Peripheral address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR4</name>
					<displayName>CPAR4</displayName>
					<description>CPAR4</description>
					<addressOffset>0x4c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>PA</name>
							<description>Peripheral address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR5</name>
					<displayName>CPAR5</displayName>
					<description>CPAR5</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>PA</name>
							<description>Peripheral address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR1</name>
					<displayName>CMAR1</displayName>
					<description>CMAR1</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>MA</name>
							<description>Memory address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR2</name>
					<displayName>CMAR2</displayName>
					<description>CMAR2</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>MA</name>
							<description>Memory address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR3</name>
					<displayName>CMAR3</displayName>
					<description>CMAR3</description>
					<addressOffset>0x3c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>MA</name>
							<description>Memory address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR4</name>
					<displayName>CMAR4</displayName>
					<description>CMAR4</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>MA</name>
							<description>Memory address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR5</name>
					<displayName>CMAR5</displayName>
					<description>CMAR5</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>MA</name>
							<description>Memory address</description>
						</field>
					</fields>
				</register>
